#include <stdio.h>
#include <stdlib.h>//Директива для роботи з пам'яттю

int main() {
    int size; //оголошення змінної size

    printf("Array size: ");// Виводимо на екран текст про введення розміру масиву
    scanf_s("%d", &size);// Зчитуємо введений розмір масиву

    int* arr = (int*)malloc(size * sizeof(int));// Виділяємо динамічну пам'ять для масиву
    if (arr == NULL) {
        printf("no data avaible\n");// Виводимо повідомлення про невдале виділення пам'яті, завершуємо програму
        return 1;
    }

    printf("Array element:\n");// Виводимо на екран текст про введення елементів масиву
    for (int i = 0; i < size; ++i) {
        printf("Element %d: ", i + 1);
        scanf_s("%d", &arr[i]);// Зчитуємо введене значення для кожного елемента масиву
    }

    int* ptr = arr; // Оголошується вказівник ptr, який вказує на початок масиву
    int sum = 0;

    for (int i = 0; i < size; ++i) {
        sum += *ptr; // Додавання значення, на яке вказує вказівник, до суми
        ptr++;       // Перехід до наступного елементу масиву
    }//Цикл для обчислення суми елементів масиву за допомогою вказівників.

    
    float average = (float)sum / size; // Обчислення середнього значення

    printf("Average value: %.2f\n", average);// Виводимо середнє значення з двома знаками після коми

    free(arr);// Звільняємо виділену пам'ять для масиву

    return 0;//Завершується функція main()
}
